tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/versions'
tap 'neovim/neovim'

brew 'ack'
brew 'libyaml'
brew 'openssl'
brew 'pkg-config'
brew 'ansible'
brew 'ant'
brew 'antiword'
brew 'gdbm'
brew 'readline'
brew 'icu4c'
brew 'sqlite'
brew 'xz'
brew 'python3'
brew 'asciinema'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'berkeley-db'
brew 'berkeley-db4'
brew 'boost'
brew 'gettext'
brew 'pcre'
brew 'git'
brew 'go'
brew 'docker'
brew 'brightness'
brew 'ghc'
brew 'cabal-install'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'libffi'
brew 'glib'
brew 'pixman'
brew 'cairo'
brew 'gmp'
brew 'isl'
brew 'cloog'
brew 'cmake'
brew 'coreutils'
brew 'cscope'
brew 'csshx'
brew 'ctags'
brew 'libsodium'
brew 'zeromq'
brew 'czmq'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'dos2unix'
brew 'drake'
brew 'drip'
brew 'ec2-api-tools'
brew 'mpfr'
brew 'libmpc'
brew 'gcc'
brew 'fftw'
brew 'jpeg'
brew 'libtiff'
brew 'little-cms2'
brew 'ghostscript'
brew 'libtool'
brew 'gobject-introspection'
brew 'harfbuzz'
brew 'pango'
brew 'imagemagick'
brew 'emacs'
brew 'epstool'
brew 'fdupes'
brew 'findutils'
brew 'fondu'
brew 'fontforge'
brew 'fpp'
brew 'gawk'
brew 'gd'
brew 'geoip'
brew 'gibo'
brew 'gl2ps'
brew 'gmime'
brew 'gnu-sed'
brew 'gnu-typist'
brew 'libusb'
brew 'libusb-compat'
brew 'gnupg'
brew 'pinentry'
brew 'gpg-agent'
brew 'gnupg2'
brew 'lua'
brew 'gnuplot'
brew 'gpgme'
brew 'gradle'
brew 'graphicsmagick'
brew 'graphviz'
brew 'hub'
brew 'irssi'
brew 'jbig2dec'
brew 'oniguruma'
brew 'jq'
brew 'lzlib'
brew 'librdkafka'
brew 'kafkacat'
brew 'leiningen'
brew 'leptonica'
brew 'libevent'
brew 'libmagic'
brew 'lynx'
brew 'mas'
brew 'maven'
brew 'md5sha1sum'
brew 'mercurial'
brew 'minimal-racket'
brew 'protobuf'
brew 'mobile-shell', args: ['HEAD']
brew 'msmtp'
brew 'mycli'
brew 'mysql'
brew 'netcat'
brew 'nmap'
brew 'node'
brew 'talloc'
brew 'xapian'
brew 'notmuch'
brew 'nvi'
brew 'nvm'
brew 'offlineimap'
brew 'p7zip'
brew 'pandoc'
brew 'pbzip2'
brew 'postgresql'
brew 'pgcli'
brew 'pidof'
brew 'pigz'
brew 'plotutils'
brew 'pstoedit'
brew 'pstree'
brew 'putty'
brew 'pv'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'
brew 'sip'
brew 'pyqt'
brew 'q'
brew 'qscintilla2'
brew 'reattach-to-user-namespace'
brew 'rlwrap'
brew 's3cmd'
brew 'sbt'
brew 'scala'
brew 'socat'
brew 'solr'
brew 'source-highlight'
brew 'ssh-copy-id'
brew 'st'
brew 'swig'
brew 'szip'
brew 'tbb'
brew 'tesseract'
brew 'texinfo'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tmux-cssh'
brew 'tokyo-cabinet'
brew 'tree'
brew 'unrar'
brew 'urlview'
brew 'macvim'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zplug'
brew 'homebrew/science/veclibfort'
brew 'homebrew/science/arpack'
brew 'homebrew/science/dotwrp'
brew 'homebrew/science/glpk'
brew 'homebrew/science/hdf5'
brew 'homebrew/science/qhull'
brew 'homebrew/science/qrupdate'
brew 'homebrew/science/suite-sparse'
brew 'homebrew/science/transpose'
brew 'neovim/neovim/neovim'

cask_args appdir: '/Applications'
cask '1password'
cask 'acorn'
cask 'adium'
cask 'airflow'
cask 'airparrot'
cask 'alfred'
cask 'atom'
cask 'bartender'
cask 'bettertouchtool'
cask 'black-screen'
cask 'brackets'
cask 'caffeine'
cask 'colloquy'
cask 'cuttle'
cask 'dash'
cask 'disk-inventory-x'
cask 'dropbox'
cask 'evernote'
cask 'fantastical'
cask 'fastscripts'
cask 'growlnotify'
cask 'iterm2'
cask 'java8'
cask 'karabiner'
cask 'key-codes'
cask 'launchcontrol'
cask 'lingon-x'
cask 'marked'
cask 'miniconda'
cask 'monodraw'
cask 'moom'
cask 'nvalt'
cask 'omnifocus'
cask 'omnigraffle'
cask 'postman'
cask 'racket'
cask 'rescuetime'
cask 'scrivener'
cask 'seil'
cask 'sequel-pro'
cask 'shimo'
cask 'skitch'
cask 'skype'
cask 'spotify'
cask 'sublime-text3'
cask 'taskpaper'
cask 'textexpander'
cask 'transmission'
cask 'vlc'
cask 'intellij-idea'
cask 'slack'

mas 'Keynote (5.0)', id: 409183694
mas 'Airmail 2 (3.0.2)', id: 918858936
mas 'Keynote (6.6.2)', id: 409183694
mas 'ReadKit (2.4.3)', id: 588726889
mas 'Numbers (2.0)', id: 409203825
mas 'Pocket (1.6.2)', id: 568494494
mas 'StreamCloud (1.4.2)', id: 894578573
mas 'Tweetbot (2.4.1)', id: 557168941
mas 'Pages (5.6.2)', id: 409201541
mas 'Deliveries (2.1.2)', id: 924726344
mas 'MindNode Pro (1.11.5)', id: 402398561
mas 'Pages (4.0)', id: 409201541
mas 'Yoink (3.2.1)', id: 457622435
mas 'Numbers (3.6.2)', id: 409203825
