tap "1password/tap"
tap "ankitpokhrel/jira-cli"
tap "aspnet/dnx"
tap "assemblyai/assemblyai"
tap "bazelbuild/tap"
tap "cirruslabs/cli"
tap "d12frosted/emacs-plus"
tap "dagger/tap"
tap "discoteq/discoteq"
tap "eth-p/software"
tap "f/mcptools"
tap "facebook/fb"
tap "felixkratz/formulae"
tap "go-delve/delve"
tap "go-swagger/go-swagger"
tap "holgerbrandl/tap"
tap "homebrew/bundle"
tap "hudochenkov/sshpass"
tap "mattt/tap"
tap "neovim/neovim"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "romkatv/powerlevel10k"
tap "saulpw/vd"
tap "thoughtbot/formulae"
tap "homebrew/cask"

brew "ack"
brew "act"
brew "adns"
brew "xz"
brew "ansible"
brew "cairo"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "openjdk"
brew "ant"
brew "antiword"
brew "webp"
brew "apktool"
brew "asciinema"
brew "aspell"
brew "autoconf"
brew "autojump"
brew "automake"
brew "autossh"
brew "axel"
brew "bash"
brew "bat"
brew "bazel"
brew "berkeley-db", link: true
brew "berkeley-db@4"
brew "binutils"
brew "bison"
brew "boost"
brew "brightness"
brew "btop"
brew "buildifier"
brew "chezmoi"
brew "clang-format"
brew "cloc"
brew "isl"
brew "cloog"
brew "cmake"
brew "ripgrep"
brew "codex"
brew "coreutils"
brew "cscope"
brew "csshx"
brew "ctags"
brew "ctop"
brew "cweb"
brew "zeromq"
brew "czmq"
brew "datamash"
brew "ddcctl"
brew "dex2jar"
brew "direnv"
brew "docker"
brew "dos2unix"
brew "doxygen"
brew "e2fsprogs"
brew "xxhash"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs", link: false
brew "jbig2dec"
brew "openjpeg"
brew "leptonica"
brew "tesseract"
brew "ghostscript"
brew "epstool"
brew "exercism"
brew "extract_url"
brew "fabric-ai"
brew "fd"
brew "fdupes"
brew "libogg"
brew "libvorbis"
brew "sdl2"
brew "findutils"
brew "libtool"
brew "fontforge"
brew "fzf"
brew "forgit"
brew "fpp"
brew "freetds"
brew "fselect"
brew "fswatch"
brew "fx"
brew "mpfr"
brew "gawk"
brew "gdrive"
brew "gh"
brew "gibo"
brew "git"
brew "git-review"
brew "git-revise"
brew "gitui"
brew "gl2ps"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "pinentry"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "gnu-sed"
brew "gnu-typist"
brew "go"
brew "libmaxminddb"
brew "tokyo-cabinet"
brew "goaccess"
brew "gperftools"
brew "gradle"
brew "graphicsmagick"
brew "graphviz"
brew "grip"
brew "gron"
brew "guile"
brew "helix"
brew "htop"
brew "hub"
brew "hyperfine"
brew "imagemagick"
brew "imagemagick@6"
brew "irssi"
brew "jadx"
brew "jo"
brew "jq"
brew "jsonnet"
brew "lzlib"
brew "librdkafka"
brew "kcat"
brew "kubernetes-cli"
brew "lazygit"
brew "leiningen"
brew "less"
brew "libmagic"
brew "libusb-compat"
brew "libvterm"
brew "llm"
brew "lua"
brew "luajit"
brew "lynx"
brew "mackup"
brew "mas"
brew "mcpm"
brew "mercurial"
brew "meson"
brew "metis"
brew "mise"
brew "moreutils"
brew "protobuf"
brew "mosh", args: ["HEAD"]
brew "mpssh"
brew "msmtp"
brew "mycli"
brew "mysql"
brew "neovim"
brew "netcat"
brew "ngrep"
brew "nmap"
brew "talloc"
brew "xapian"
brew "notmuch"
brew "nvi"
brew "nvm"
brew "ocaml"
brew "ocaml-findlib"
brew "pngquant"
brew "unpaper"
brew "ocrmypdf"
brew "offlineimap"
brew "openjdk@17"
brew "p7zip"
brew "pandoc"
brew "pbzip2"
brew "pgcli"
brew "php"
brew "pidof"
brew "pigz"
brew "plotutils"
brew "poppler"
brew "postgresql@14"
brew "pre-commit", link: false
brew "pstree"
brew "pth"
brew "pure"
brew "putty"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "qt"
brew "pyqt"
brew "python-yq"
brew "python@3.10"
brew "python@3.11"
brew "python@3.8"
brew "python@3.9"
brew "pyyaml"
brew "qcachegrind"
brew "qhull"
brew "qscintilla2"
brew "qt@5"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "repomix"
brew "rlwrap"
brew "rsync"
brew "s3cmd"
brew "sbt"
brew "scala"
brew "scantailor"
brew "scmpuff"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "shellcheck"
brew "sip"
brew "smartmontools"
brew "socat"
brew "solr"
brew "source-highlight"
brew "ssh-copy-id", link: true
brew "st"
brew "swiftformat"
brew "swiftlint"
brew "telnet"
brew "terminal-notifier"
brew "terraform"
brew "tesseract-lang"
brew "the_silver_searcher"
brew "tig"
brew "tree"
brew "typst"
brew "urlview"
brew "uv"
brew "vim"
brew "virtualenv", link: false
brew "watch"
brew "watchman"
brew "weasyprint"
brew "wget"
brew "whalebrew"
brew "winetricks"
brew "wireshark"
brew "xcodegen"
brew "yarn"
brew "zip"
brew "zplug"
brew "zsh"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "assemblyai/assemblyai/assemblyai"
brew "cirruslabs/cli/tart"
brew "d12frosted/emacs-plus/emacs-plus@28"
brew "eth-p/software/bat-extras-batman"
brew "f/mcptools/mcp"
brew "facebook/fb/idb-companion"
brew "felixkratz/formulae/borders"
brew "hudochenkov/sshpass/sshpass"
brew "oven-sh/bun/bun"

cask "1password", args: { appdir: "/Applications" }
cask "1password-cli"
cask "acorn", args: { appdir: "/Applications" }
cask "adium", args: { appdir: "/Applications" }
cask "aerospace"
cask "airflow", args: { appdir: "/Applications" }
cask "alfred", args: { appdir: "/Applications" }
cask "anaconda"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "atom", args: { appdir: "/Applications" }
cask "bartender", args: { appdir: "/Applications" }
cask "bettertouchtool"
cask "burp-suite"
cask "caffeine", args: { appdir: "/Applications" }
cask "claude"
cask "cleanshot"
cask "companion"
cask "conductor"
cask "container-use"
cask "dash", args: { appdir: "/Applications" }
cask "db-browser-for-sqlite"
cask "disk-inventory-x", args: { appdir: "/Applications" }
cask "dropbox"
cask "evernote", args: { appdir: "/Applications" }
cask "fantastical", args: { appdir: "/Applications" }
cask "fastscripts", args: { appdir: "/Applications" }
cask "font-inter"
cask "font-meslo-for-powerline"
cask "gcloud-cli"
cask "google-chrome"
cask "google-drive"
cask "imcp"
cask "intellij-idea"
cask "iterm2"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "key-codes", args: { appdir: "/Applications" }
cask "launchcontrol", args: { appdir: "/Applications" }
cask "mactex"
cask "macwhisper"
cask "marked-app", args: { appdir: "/Applications" }
cask "miniconda", args: { appdir: "/Applications" }
cask "mitmproxy"
cask "monodraw", args: { appdir: "/Applications" }
cask "moom", args: { appdir: "/Applications" }
cask "mtmr"
cask "naps2"
cask "nvalt", args: { appdir: "/Applications" }
cask "obsidian"
cask "ollama-app"
cask "omnifocus", args: { appdir: "/Applications" }
cask "omnigraffle", args: { appdir: "/Applications" }
cask "opcode"
cask "orbstack"
cask "postman", args: { appdir: "/Applications" }
cask "prince"
cask "raycast"
cask "rescuetime", args: { appdir: "/Applications" }
cask "rocket"
cask "scrivener", args: { appdir: "/Applications" }
cask "sequel-pro", args: { appdir: "/Applications" }
cask "setapp"
cask "skitch", args: { appdir: "/Applications" }
cask "skype", args: { appdir: "/Applications" }
cask "slack"
cask "sloth"
cask "spotify", args: { appdir: "/Applications" }
cask "taskpaper", args: { appdir: "/Applications" }
cask "textexpander", args: { appdir: "/Applications" }
cask "transmission", args: { appdir: "/Applications" }
cask "tuist"
cask "utm"
cask "vial"
cask "vibetunnel"
cask "visual-studio-code"
cask "vlc"
cask "voiceink"
cask "wkhtmltopdf"
cask "xquartz"
cask "zed"
cask "zen"

mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Calendar 366 II", id: 1265895169
mas "Canva", id: 897446215
mas "Deliveries", id: 924726344
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LiquidText", id: 922765270
mas "Lungo", id: 1263070803
mas "MeetInOne", id: 1542778639
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager", id: 451907568
mas "Pocket", id: 568494494
mas "ReadKit", id: 588726889
mas "Tailscale", id: 1475387142
mas "Things", id: 904280696
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835

vscode "anthropic.claude-code"
vscode "bee.git-temporal-vscode"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "codeium.windsurfpyright"
vscode "eamodio.gitlens"
vscode "evzen-wybitul.magic-racket"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "golf1052.code-sync"
vscode "haskell.haskell"
vscode "jcanero.hoogle-vscode"
vscode "justusadam.language-haskell"
vscode "kangping.protobuf"
vscode "marp-team.marp-vscode"
vscode "mrkou47.thrift-syntax-support"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "myriad-dreamin.tinymist"
vscode "naveenvignesh5nv.html-live-server"
vscode "phgn.vscode-starlark"
vscode "phoityne.phoityne-vscode"
vscode "pomdtr.excalidraw-editor"
vscode "rcook.ghci-helper"
vscode "rubberduck.rubberduck-vscode"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "specstory.specstory-vscode"
vscode "visortelle.haskell-spotlight"
vscode "vscodevim.vim"
vscode "yzane.markdown-pdf"
