tap "1password/tap"
tap "aspnet/dnx"
tap "bazelbuild/tap"
tap "cirruslabs/cli"
tap "dagger/tap"
tap "discoteq/discoteq"
tap "eugene1g/safehouse"
tap "f/mcptools"
tap "facebook/fb"
tap "felixkratz/formulae"
tap "go-delve/delve"
tap "hashicorp/tap"
tap "holgerbrandl/tap"
tap "hudochenkov/sshpass"
tap "juxt/allium"
tap "manaflow-ai/cmux"
tap "mattt/tap"
tap "neovim/neovim"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "peripheryapp/periphery"
tap "prateek/tap"
tap "romkatv/powerlevel10k"
tap "saulpw/vd"
tap "steipete/tap"
tap "thoughtbot/formulae"

brew "ack"
brew "act"
brew "actionlint"
brew "cairo"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "asciinema"
brew "autoconf"
brew "zoxide"
brew "automake"
brew "bash"
brew "bat"
brew "bazel"
brew "binutils"
brew "boost"
brew "brightness"
brew "btop"
brew "buildifier"
brew "chezmoi"
brew "clang-format"
brew "cloc"
brew "isl"
brew "cloog"
brew "cmake"
brew "ripgrep"
brew "coreutils"
brew "cscope"
brew "csshx"
brew "ctags"
brew "ctop"
brew "cweb"
brew "czmq"
brew "datamash"
brew "ddcctl"
brew "direnv"
brew "docker"
brew "dos2unix"
brew "doxygen"
brew "e2fsprogs"
brew "eugene1g/safehouse/agent-safehouse"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "openjpeg"
brew "leptonica"
brew "tesseract"
brew "ghostscript"
brew "codex-acp"
brew "extract_url"
brew "fabric-ai"
brew "fastlane"
brew "fd"
brew "fdupes"
brew "libogg"
brew "libvorbis"
brew "sdl2"
brew "findutils"
brew "libtool"
brew "fontforge"
brew "fzf"
brew "forgit"
brew "fswatch"
brew "fennel"
brew "mpfr"
brew "gawk"
brew "gdrive"
brew "gemini-cli"
brew "gh"
brew "gibo"
brew "git"
brew "git-delta"
brew "gitleaks"
brew "git-review"
brew "git-revise"
brew "git-spice"
brew "git-subrepo"
brew "gitui"
brew "gl2ps"
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "pinentry"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "gnu-sed"
brew "gnu-typist"
brew "libmaxminddb"
brew "tokyo-cabinet"
brew "go"
brew "goaccess"
brew "gogcli"
brew "gperftools"
brew "graphicsmagick"
brew "graphviz"
brew "helix"
brew "htop"
brew "tmux"
brew "hub"
brew "hyperfine"
brew "imagemagick"
brew "imagemagick@6"
brew "irssi"
brew "jq"
brew "jsonnet"
brew "juxt/allium/allium"
brew "lzlib"
brew "librdkafka"
brew "kcat"
brew "kubernetes-cli"
brew "lazygit"
brew "leiningen"
brew "less"
brew "libpq"
brew "libmagic"
brew "libusb-compat"
brew "libvterm"
brew "llm"
brew "lua"
brew "luajit"
brew "lynx"
brew "mackup"
brew "mas"
brew "mcpm"
brew "meson"
brew "mise"
brew "moreutils"
brew "protobuf"
brew "mosh", args: ["HEAD"]
brew "mpssh"
brew "msmtp"
brew "mycli"
brew "mysql"
brew "neovim"
brew "netcat"
brew "ngrep"
brew "nmap"
brew "talloc"
brew "ocaml-findlib"
brew "pngquant"
brew "unpaper"
brew "ocrmypdf"
brew "offlineimap"
brew "openjdk"
brew "p7zip"
brew "pandoc"
brew "pbzip2"
brew "pgcli"
brew "pigz"
brew "plotutils"
brew "poppler"
brew "pre-commit", link: false
brew "pstree"
brew "pth"
brew "pure"
brew "pv"
brew "prateek/tap/agentsview"
brew "python-yq"
brew "python@3.11"
brew "qcachegrind"
brew "qscintilla2"
brew "ranger"
brew "reattach-to-user-namespace"
brew "redis"
brew "repomix"
brew "rlwrap"
brew "rsync"
brew "s3cmd"
brew "scmpuff"
brew "sdl2_image"
brew "sdl2_mixer"
brew "shellcheck"
brew "sip"
brew "smartmontools"
brew "socat"
brew "ssh-copy-id", link: true
brew "st"
brew "swiftformat"
brew "swiftlint"
brew "telnet"
brew "terminal-notifier"
brew "hashicorp/tap/terraform"
brew "the_silver_searcher"
brew "tig"
brew "tree"
brew "typst"
brew "urlview"
brew "uv"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "winetricks"
brew "wireshark"
brew "xcbeautify"
brew "xcodegen"
brew "yarn"
brew "zig"
brew "zip"
brew "zplug"
brew "zsh"
brew "cirruslabs/cli/tart"
brew "f/mcptools/mcp"
brew "facebook/fb/idb-companion"
brew "felixkratz/formulae/borders"
brew "hudochenkov/sshpass/sshpass"
brew "oven-sh/bun/bun"

cask "1password", args: { appdir: "/Applications" }
cask "1password-cli"
cask "codex"
cask "aerospace"
cask "alfred", args: { appdir: "/Applications" }
cask "agentsview-desktop"
cask "bartender", args: { appdir: "/Applications" }
cask "bettertouchtool"
cask "caffeine", args: { appdir: "/Applications" }
# Setapp-managed apps are installed after Setapp login. Use setapp-cli for scripted Setapp app installs:
# https://github.com/maximlevey/setapp-cli
# CleanShot X is installed via Setapp, not Homebrew.
# cask "cleanshot"
cask "claude"
cask "cmux"
cask "container-use"
cask "codexbar"
cask "fastscripts", args: { appdir: "/Applications" }
cask "font-inter"
cask "font-meslo-for-powerline"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-drive"
cask "google-chrome"
cask "hammerspoon", args: { appdir: "/Applications" }
cask "imcp"
cask "intellij-idea"
cask "iterm2"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "key-codes", args: { appdir: "/Applications" }
cask "launchcontrol", args: { appdir: "/Applications" }
cask "leader-key"
cask "mitmproxy"
cask "monodraw", args: { appdir: "/Applications" }
cask "moom", args: { appdir: "/Applications" }
cask "nvalt", args: { appdir: "/Applications" }
cask "obsidian"
cask "ollama-app"
cask "orbstack"
cask "periphery"
cask "prince"
cask "raycast"
cask "rescuetime", args: { appdir: "/Applications" }
cask "rocket"
cask "scrivener", args: { appdir: "/Applications" }
cask "setapp"
cask "slack"
cask "spotify", args: { appdir: "/Applications" }
cask "taskpaper", args: { appdir: "/Applications" }
cask "tuist"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "voiceink"
cask "xquartz"
cask "tailscale-app"
cask "zed"

mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Goodnotes", id: 1444383602
mas "Lungo", id: 1263070803
mas "Okta Verify", id: 490179405
mas "Things", id: 904280696
mas "Xcode", id: 497799835
