tap "1password/tap"
tap "ankitpokhrel/jira-cli"
tap "aspnet/dnx"
tap "bazelbuild/tap"
tap "d12frosted/emacs-plus"
tap "discoteq/discoteq"
tap "eth-p/software"
tap "go-delve/delve"
tap "go-swagger/go-swagger"
tap "holgerbrandl/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "neovim/neovim"
tap "romkatv/powerlevel10k"
tap "saulpw/vd"
tap "thoughtbot/formulae"
tap "uber/alt", "gitolite@code.uber.internal:homebrew-alt"
brew "ack"
brew "adns"
brew "xz"
brew "ansible"
brew "cairo"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "openjdk"
brew "ant"
brew "antiword"
brew "webp"
brew "asciinema"
brew "aspell"
brew "autoconf"
brew "autojump"
brew "automake"
brew "autossh"
brew "axel"
brew "bash"
brew "bat"
brew "bazel"
brew "berkeley-db", link: true
brew "berkeley-db@4"
brew "binutils"
brew "bison"
brew "boost"
brew "brightness"
brew "buildifier"
brew "ghc"
brew "cabal-install"
brew "clang-format"
brew "cloc"
brew "isl"
brew "cloog"
brew "coreutils"
brew "cscope"
brew "csshx"
brew "ctags"
brew "ctop"
brew "zeromq"
brew "czmq"
brew "datamash"
brew "ddcctl"
brew "direnv"
brew "docker"
brew "dos2unix"
brew "doxygen"
brew "e2fsprogs"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs", link: false
brew "jbig2dec"
brew "openjpeg"
brew "ghostscript"
brew "epstool"
brew "exercism"
brew "extract_url"
brew "fasd"
brew "fd"
brew "fdupes"
brew "findutils"
brew "libogg"
brew "libvorbis"
brew "libtool"
brew "fontforge"
brew "fpp"
brew "freetds"
brew "fselect"
brew "fx"
brew "fzf"
brew "mpfr"
brew "gawk"
brew "gdrive"
brew "geoip"
brew "gibo"
brew "git"
brew "git-review"
brew "git-revise"
brew "gitui"
brew "gl2ps"
brew "glide", link: false
brew "libgpg-error"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "libusb"
brew "pinentry"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "gnu-sed"
brew "gnu-typist"
brew "go@1.16"
brew "go@1.18"
brew "libmaxminddb"
brew "tokyo-cabinet"
brew "goaccess"
brew "openjdk@17"
brew "gradle"
brew "graphicsmagick"
brew "graphviz"
brew "gron"
brew "guile"
brew "htop"
brew "hub"
brew "hyperfine"
brew "imagemagick@6"
brew "irssi"
brew "jo"
brew "jsonnet"
brew "lzlib"
brew "librdkafka"
brew "kcat"
brew "kubernetes-cli"
brew "leiningen"
brew "leptonica"
brew "less"
brew "libmagic"
brew "libusb-compat"
brew "libvterm"
brew "lua"
brew "luajit"
brew "lynx"
brew "mackup"
brew "mas"
brew "mercurial"
brew "meson"
brew "metis"
brew "moreutils"
brew "protobuf"
brew "mosh", args: ["HEAD"]
brew "mpssh"
brew "msmtp"
brew "mycli"
brew "mysql"
brew "neovim"
brew "netcat"
brew "ngrep"
brew "nmap"
brew "node"
brew "talloc"
brew "xapian"
brew "notmuch"
brew "nvi"
brew "nvm"
brew "ocaml"
brew "ocaml-findlib"
brew "offlineimap"
brew "p7zip"
brew "pandoc"
brew "pbzip2"
brew "pgcli"
brew "pidof"
brew "pigz"
brew "plotutils"
brew "postgresql@14"
brew "virtualenv"
brew "pre-commit"
brew "pstree"
brew "pth"
brew "pure"
brew "putty"
brew "pv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "qt"
brew "pyqt"
brew "python-yq"
brew "python@3.10"
brew "python@3.8"
brew "python@3.9"
brew "qcachegrind"
brew "qhull"
brew "qscintilla2"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "rlwrap"
brew "xxhash"
brew "rsync"
brew "s3cmd"
brew "sbt"
brew "scala"
brew "scmpuff"
brew "sdl2"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_ttf"
brew "shellcheck"
brew "sip"
brew "smartmontools"
brew "socat"
brew "solr"
brew "source-highlight"
brew "ssh-copy-id", link: true
brew "st"
brew "telnet"
brew "terminal-notifier"
brew "tesseract"
brew "the_silver_searcher"
brew "utf8proc"
brew "tmux"
brew "tree"
brew "urlview"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "whalebrew"
brew "winetricks"
brew "yarn"
brew "zplug"
brew "zsh"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "d12frosted/emacs-plus/emacs-plus@28"
brew "eth-p/software/bat-extras-batman"
brew "go-swagger/go-swagger/go-swagger"
brew "saulpw/vd/visidata"
brew "thoughtbot/formulae/gitsh"
brew "uber/alt/php@7.4"
brew "uber/alt/assigner"
brew "uber/alt/cerberus"
brew "uber/alt/grail"
brew "uber/alt/hostissue"
brew "uber/alt/itea"
brew "uber/alt/llc"
brew "uber/alt/lzc"
brew "uber/alt/moncon"
brew "uber/alt/peloton"
brew "uber/alt/perftool"
brew "uber/alt/reliability-data-platform-tools"
brew "uber/alt/stargen"
brew "uber/alt/tb-cli"
brew "uber/alt/trafficctl"
brew "uber/alt/uns"
brew "uber/alt/upt"
brew "uber/alt/uber-developer"
brew "uber/alt/uber-odin-tool"
brew "uber/alt/ubuild-cli"
brew "uber/alt/uhostd-client"
brew "uber/alt/ulog"
brew "uber/alt/up"
brew "uber/alt/wonkacli"
cask "1password", args: { appdir: "/Applications" }
cask "1password-cli"
cask "acorn", args: { appdir: "/Applications" }
cask "adium", args: { appdir: "/Applications" }
cask "airflow", args: { appdir: "/Applications" }
cask "alfred", args: { appdir: "/Applications" }
cask "anaconda"
cask "atom", args: { appdir: "/Applications" }
cask "bartender", args: { appdir: "/Applications" }
cask "bettertouchtool"
cask "caffeine", args: { appdir: "/Applications" }
cask "cleanshot"
cask "dash", args: { appdir: "/Applications" }
cask "disk-inventory-x", args: { appdir: "/Applications" }
cask "evernote", args: { appdir: "/Applications" }
cask "fantastical", args: { appdir: "/Applications" }
cask "fastscripts", args: { appdir: "/Applications" }
cask "font-meslo-for-powerline"
cask "growlnotify", args: { appdir: "/Applications" }
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "key-codes", args: { appdir: "/Applications" }
cask "launchcontrol", args: { appdir: "/Applications" }
cask "marked", args: { appdir: "/Applications" }
cask "miniconda", args: { appdir: "/Applications" }
cask "monodraw", args: { appdir: "/Applications" }
cask "moom", args: { appdir: "/Applications" }
cask "mtmr"
cask "nvalt", args: { appdir: "/Applications" }
cask "obsidian"
cask "omnifocus", args: { appdir: "/Applications" }
cask "omnigraffle", args: { appdir: "/Applications" }
cask "postman", args: { appdir: "/Applications" }
cask "rescuetime", args: { appdir: "/Applications" }
cask "scrivener", args: { appdir: "/Applications" }
cask "sequel-pro", args: { appdir: "/Applications" }
cask "skitch", args: { appdir: "/Applications" }
cask "skype", args: { appdir: "/Applications" }
cask "sloth"
cask "spotify", args: { appdir: "/Applications" }
cask "taskpaper", args: { appdir: "/Applications" }
cask "textexpander", args: { appdir: "/Applications" }
cask "transmission", args: { appdir: "/Applications" }
cask "vial"
cask "xquartz"
mas "Amphetamine", id: 937984704
mas "Calendar 366 II", id: 1265895169
mas "Deliveries", id: 924726344
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LiquidText", id: 922765270
mas "Lungo", id: 1263070803
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paprika Recipe Manager", id: 451907568
mas "Pocket", id: 568494494
mas "ReadKit", id: 588726889
mas "Things", id: 904280696
mas "Tweetbot", id: 557168941
mas "Xcode", id: 497799835
