anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-containers
anysphere.remote-ssh
bazelbuild.vscode-bazel
bee.git-temporal-vscode
bradlc.vscode-tailwindcss
charliermarsh.ruff
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
evzen-wybitul.magic-racket
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
golf1052.code-sync
hashicorp.terraform
kangping.protobuf
marp-team.marp-vscode
matangover.mypy
mechatroner.rainbow-csv
mrkou47.thrift-syntax-support
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
naumovs.color-highlight
naveenvignesh5nv.html-live-server
nsarrazin.pep723-uv-interpreter
openai.chatgpt
orta.vscode-jest
phgn.vscode-starlark
redhat.vscode-yaml
rust-lang.rust-analyzer
shd101wyy.markdown-preview-enhanced
specstory.specstory-vscode
timonwong.shellcheck
usernamehw.errorlens
vscodevim.vim
wix.vscode-import-cost
